%% =====================================================
%  پروژه آنالیز عددی
%  تابع:
%  F(x)=1+∫[0,tan(x)] exp(-(t-1)^2) dt
%  بازه : [0 , 0.5]
%% =====================================================

clc
clear
close all


%% =====================================================
%  Part 1 : تولید نقاطی برای محاسبه ی مقادیری از مشتق تابع(به صورت عددی، روش سه نقطه ای مرکزی)

n = 20;     %تعداد نقاط
x = linspace(0, 0.5, n);
h = (x(2) - x(1)) / 1000;     %فاصله مورد استفاده در روش سه نقطه ای


dF = zeros(1, n);

for i = 1:n

    dF(i) = (F(x(i) + h) - F(x(i) - h)) / (2*h);

end

disp('جدول مقادیر مشتق تابع:')
fprintf("   %-19s %-19s \n" , "x" , "F'(x)")
disp([x' dF'])

%% =====================================================
%  Part 2 : درون یابی چند جمله ای

% روش اول: استفاده از تابع خود متلب
% p = polyfit(x,dF,n - 1);
% disp('ضرایب چندجمله‌ای درون‌یابی:')
% disp(p)
%%====================================
% روش دوم: ساخت تابع چندجمله‌ای درون‌یاب لاگرانژ

syms X
p = 0;

for i = 1:n

    L = 1;

    for j = 1:n

        if j ~= i
            L = L * (X - x(j)) / (x(i) - x(j));
        end

    end

    p = p + dF(i) * L;

end

p = expand(p);
p = matlabFunction(p);

%% =====================================================
%  Part 4 : شیب متوسط تابع

m = F(0.5) / 0.5;

disp('شیب = ')
disp(m)

%% =====================================================
%  Part 5 : یافتن ریشه

% روش اول: استفاده از توابع آماده ی متلب
%g = @(z) polyval(p,z) - m;
%c = fzero(g,[0 0.5]);
%disp('مقدار c = ')
%disp(c)
%%===============================
% روش دوم: یافتن ریشه با روش دوبخشی

g = @(x) p(x) - m;
a = 0;
b = 0.5;
tol = 1e-8;

while (b-a)/2 > tol

    c = (a+b)/2;

    if g(a)*g(c) < 0
        b = c;
    else
        a = c;
    end

end

c = (a+b)/2;
disp('c = ')
disp(c)

%% =====================================================
%  Part 6 : نمودار نهایی

t = linspace(0,0.5,1000);
p_t = p(t);

figure('Position', [1000, 100, 650, 600])

plot(x, zeros(1,n) , 'r|', 'LineWidth', 2);
hold on;
plot(x , dF, 'r.' , 'MarkerSize', 20);
hold on;
plot(t , p_t, 'g', 'LineWidth', 2);
hold on;
plot(c, p(c), 'yo', 'MarkerSize', 8, 'LineWidth', 2);
grid on;
legend("x(i)", "F'(x(i))", "p(x)", "(c, p(c))")